GlomarGadaffi/pocket-dial/sdkconfig.defaults
# Target SoC. Pinned so a stray sdkconfig regeneration can't silently fall back
# to IDF's default 'esp32' target (which breaks the esp32s3 build: PSRAM, the
# AXS15231B display, and the 16MB layout all assume esp32s3). Without this, an
# `idf.py build` that has to regenerate sdkconfig produces an esp32 config that
# mismatches the CMake cache and aborts.
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3 CPU & Frequency settings
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# SPIRAM (OPI PSRAM) Configurations
#
# ⚠ HARD PSRAM REQUIREMENT (ported from drawbridge audit #71 — pocket-dial's own
# issue numbering differs). Every image built from this file targets an ESP32-S3
# WITH octal PSRAM (S3R8: 8 MB OPI). CONFIG_SPIRAM_BOOT_INIT=y below initialises
# PSRAM in the bootloader, and IDF's own Kconfig help for SPIRAM_IGNORE_NOTFOUND
# spells out what happens without the chip: "if psram initialization is enabled
# during compile time but not found at runtime, it is seen as an error making
# the CPU panic". That panic happens before the app runs, so there is no log
# line, no dashboard, no console — just a board that reboots.
#
# WHY THIS MATTERS MORE HERE THAN IT DID IN DRAWBRIDGE: this repo publishes a
# BROWSER FLASHER (docs/flasher/index.html, serving the images under
# docs/firmware/<version>/ that .github/workflows/release.yml builds). Its
# variants — esp32s3-wifi, esp32s3-eth, esp32s3-display — are one click away for
# anyone with a WebSerial browser and an S3 on their desk. The generic SoftAP
# `wifi` variant is the exposed one: it names no particular board, so the
# obvious thing for a stranger to do is flash it onto whatever ESP32-S3 they
# own — and the WROOM-1 parts without an R suffix (N8, N16, the common bare
# dev-board configuration) have NO PSRAM at all; only the Rn variants (N8R8,
# N16R8) do. The failure therefore lands on someone else's bench, where nobody
# can read a serial log or ask us what happened. (The `display` variant would fail
# regardless: its LVGL double frame buffers, 307.2 KB each, are allocated
# MALLOC_CAP_SPIRAM — see docs/HARDWARE.md:63.)
#
# CONFIG_SPIRAM_IGNORE_NOTFOUND IS DELIBERATELY NOT SET. It would downgrade the
# missing chip to a boot warning — but the same Kconfig help notes that it also
# silently re-sizes the WiFi/LWIP buffers to their no-SPIRAM defaults, so the
# unit would come up in a configuration nothing in this repo has ever tested,
# carrying calls, with the heap and socket budgets this file's other settings
# (LWIP_MAX_SOCKETS=48, MBEDTLS_EXTERNAL_MEM_ALLOC=y below) all assume PSRAM
# for. A half-functional PBX is worse than an obviously dead one — and a silent
# PSRAM-off drift (a regenerated sdkconfig, a wrong overlay) would then ship
# instead of failing at build/boot.
#
# There is NO no-PSRAM S3 profile in this tree. sdkconfig.defaults.esp32_constrained
# does set CONFIG_SPIRAM=n, but it is the classic-ESP32 WROOM profile (4 MB DIO
# flash, 520 KB SRAM, lan8720) and needs `set-target esp32` — it is not an S3
# image. If a cross-board S3 image is ever genuinely wanted, it belongs in its
# own overlay file with its own flasher variant id and its own hardware test,
# not in IGNORE_NOTFOUND bolted onto the image the flasher hands to strangers.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_MEMTEST=n

# Flash Settings (16MB QIO)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Common ESP system settings
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# LVGL Config overrides (if using custom lv_conf.h, or via Kconfig)
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
# AXS15231B QSPI expects byte-swapped RGB565 (the working reference sets swap_bytes=1).
# Without this, bright colors come out near-black because the two bytes are reversed.
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_TICK_CUSTOM=y
CONFIG_LV_TICK_CUSTOM_INCLUDE="esp_timer.h"
CONFIG_LV_TICK_CUSTOM_SYS_TIME_EXPR="esp_timer_get_time() / 1000"

# User requested additions for CI build fix
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA (Phase-1 production hardening) — see docs/OTA.md.
# Enables the bootloader anti-rollback / app-validation workflow so a freshly
# flashed OTA image boots in the "pending verify" state and is rolled back to the
# previous slot on the next reset UNLESS the app calls
# esp_ota_mark_app_valid_cancel_rollback() (we do this on a clean boot via
# OtaUpdater::markValid()). This is the single canonical Kconfig symbol for the
# feature in ESP-IDF v5.x; there is no separate CONFIG_APP_ROLLBACK_ENABLE.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y


# The HTTP dashboard's accept loop runs as a std::thread (pthread). handleClient
# -> sendApiStatus builds a JSON response + snapshot vector copies that overflow
# the 3 KB default pthread stack on-device (works on host where threads have
# MB-sized stacks; that mismatch made the dashboard unreachable on a real LAN
# while SIP, on a properly-sized FreeRTOS task, kept working). Give std::thread
# tasks a realistic stack.
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# wolfSSL (display/SSH build only). The wolfSSL ESP component emits a #warning
# "RSA may be difficult with less than 10KB Stack" when CONFIG_ESP_MAIN_TASK_STACK_SIZE
# < 10500. Under IDF v6.0.1's -Werror=cpp a #warning is a hard error. The wolfSSH
# server runs in its own 24KB task (not the main task) and uses ECC, not RSA, so the
# warning is irrelevant here — suppress it via the wolfSSL-provided Kconfig escape hatch.
# (Harmless/ignored for non-display builds that don't link wolfSSL.)
CONFIG_ESP_WOLFSSL_NO_STACK_SIZE_BUILD_WARNING=y

# lwIP receive mailbox depth (Issue #78, stress-test finding #1).
# The IDF default of 6 overruns under a burst of simultaneous SIP packets from one
# source — the packets are dropped at the lwip layer before the SIP task ever sees
# them (30 parallel REGISTERs measured 0 responses; the same REGISTER sent singly
# succeeds). This board has ample headroom (~200 KB free internal RAM per the
# v1.2.0 size analysis) for the few extra KB this costs. The 4MB/no-PSRAM
# constrained profile (sdkconfig.defaults.esp32_constrained) deliberately keeps
# CONFIG_LWIP_UDP_RECVMBOX_SIZE=6 and is layered on top of this file, so it is
# unaffected.
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32


# ── Task-stack overflow: fail loud, immediately (docs/THREAT_MODEL.md T-7) ──
# The lesson of the UNISOC T612 VoLTE RCE: on an RTOS a parser that spends the
# call stack turns a stack overflow into native code execution, because the
# bytes past the end of one task's stack are another task's stack (and its
# saved return addresses / function pointers). The SIP parser runs on the 16 KB
# udp_receiver_task and is non-recursive and bounded by construction (see
# SipMessage::checkSdp and tests/tools/check_parser_callgraph.py) -- these two
# settings are the backstop for the day a future change forgets that.
#
# WATCHPOINT_END_OF_STACK arms a hardware debug watchpoint on the last 32 bytes
# of every task's stack, so the FIRST write past the end traps into the panic
# handler -- not the next context switch, by which time the neighbour is
# already corrupted (the canary check alone, which stays on, only catches it
# then). Costs one of the two watchpoints (OpenOCD keeps the other).
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
# -fstack-protector-strong: a per-frame canary on every function that holds an
# array or takes a local's address (i.e. every parser frame), verified before
# return. A smashed return address becomes an abort in __stack_chk_fail rather
# than a jump. The code-size cost is a few percent on the parser TUs only.
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y

# ── Telephony WAN anchor: socket pool + TLS session resumption ──────────────
# TelephonyAnchorClient (ported from drawbridge) opens 3 persistent TLS sockets
# regardless of call count (control WS + ctrl POST + status GET) plus +2 per
# active call slot (warm POST + GET stream), on top of 2 LAN RTP UDP sockets
# per bridged anchor call. The W5500 runs in MACRAW mode, so LWIP's own socket
# pool (not the chip's 8-socket HW TCP engine) is what's consumed, and this
# board also carries socket consumers drawbridge doesn't (POCKETDIAL_CONF_LEGS
# local conference legs, the littlessh/wolfSSH sysop terminal) — so this stays
# at drawbridge's own hardware-confirmed number (socket() failed at the 3rd-4th
# concurrent call with a 16-24 pool at N=8 anchor calls) rather than a smaller
# one, even though POCKETDIAL_MAX_ANCHOR_CALLS ships at 1 today. IDF default is
# 10, which starves the instant the anchor's 3 persistent sockets join SIP/
# dashboard/SSH.
CONFIG_LWIP_MAX_SOCKETS=48

# TLS session resumption for the anchor's persistent connections
# (makeAuthedClient() sets save_client_session per-client already). Without
# these two, save_client_session is inert and every reconnect pays a full
# software ECDHE (the S3 has no ECC accelerator); without the two below, a 4th
# concurrent TLS context (e.g. a drop-call POST arriving while WS+GET+POST are
# all live) can alloc-fail on internal RAM (mbedtls_ssl_setup -0x008D —
# drawbridge issue #94).
CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS=y
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Issue #159 (SMTP client): required to build the SMTP config's "insecure"
# toggle at all. Leaving esp_tls_cfg_t's cacert_buf/crt_bundle_attach both
# unset does NOT silently skip verification -- esp_tls_mbedtls.c hard-fails
# the handshake (ESP_ERR_MBEDTLS_SSL_SETUP_FAILED, "No server verification
# option set") unless this Kconfig symbol is on; it exists specifically to
# gate that escape hatch at build time. Enabling it here does not itself make
# any connection insecure: SmtpClient only reaches the VERIFY_NONE path when
# the operator has explicitly turned on the per-account insecureSkipVerify
# toggle (default OFF, documented LAN-relay-only -- see docs/API.md's
# POST /api/email and docs/THREAT_MODEL.md). Every other esp_tls/
# esp_http_client caller in this tree (TelephonyAnchorClient.cpp's WSS/HTTPS)
# keeps supplying crt_bundle_attach and is unaffected.
#
# ESP_TLS_SKIP_SERVER_CERT_VERIFY itself `depends on ESP_TLS_INSECURE` (see
# components/esp-tls/Kconfig) -- without also selecting that parent symbol,
# kconfgen silently drops the child as "not visible (disabled dependency)"
# and CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY never lands in sdkconfig at all,
# so esp_crt_bundle-less connections would hard-fail instead of going
# insecure. Caught by reading the `idf.py set-target` NOTE log, not by any
# host test (this Kconfig gate has no host-testable equivalent).
#
# FLEET-WIDE FAILURE-MODE CHANGE, not a per-caller opt-in: the option's own
# Kconfig help says esp-tls goes unverified "by default ... when no other
# option regarding the server cert verification is opted in" -- i.e. this
# symbol flips esp_tls from FAIL-CLOSED (a caller that forgets cacert_buf/
# crt_bundle_attach hard-fails the handshake) to FAIL-OPEN (it silently
# connects with no verification at all) for every esp_tls/esp_http_client/
# esp_websocket_client consumer in this tree, not just SmtpClient. Audited
# 2026-09-14 (issue #159): every current caller sets crt_bundle_attach or a
# pinned cacert_buf --
#   src/Helpers/GoogleServiceAuth.cpp   (esp_http_client, oauth2.googleapis.com POST)
#   src/Helpers/SmtpClient.cpp          (esp_tls_cfg_t x2 -- both branch on
#                                         insecureSkipVerify/caCertPem/crt_bundle_attach)
#   src/SIP/TelephonyAnchorClient.cpp   (esp_websocket_client + esp_http_client x1 each)
# -- and OtaUpdater.cpp does not use esp_https_ota / any network client at all
# (it only writes bytes the dashboard already received over its own HTTP
# server into the OTA partition, so it has no esp_tls_cfg_t to audit). A
# FUTURE caller that omits verification config now connects silently
# unverified instead of failing loudly at handshake time -- re-run this grep
# and re-audit before merging any PR that adds a new esp_tls/esp_http_client/
# esp_websocket_client consumer:
#   grep -rn "esp_http_client_config_t\|esp_websocket_client_config_t\|esp_https_ota_config_t\|esp_tls_cfg_t" src/ main/
#   grep -rn "crt_bundle_attach\|cacert_buf\|use_global_ca_store" src/ main/
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# ── Heap corruption detection ────────────────────────────────────────────────
# The two settings above cover the STACK. Until now the heap had nothing
# (HEAP_POISONING_DISABLED, the IDF default), which was defensible when the
# hardening focus was the SIP parser's stack recursion (T-7) but is not any
# more: the HTTP plane runs a detached thread per connection, each with a heap
# read buffer, serves a ~55 KB page blob that is copied more than once per
# request, and the display build malloc()s ~19 KB for the QR canvas.
#
# LIGHT adds a canary to each allocation and verifies it on free()/realloc(),
# so a heap overflow or double-free aborts at the next free instead of quietly
# corrupting a neighbour. The cost is a few bytes per allocation and a check on
# a path that is not hot.
#
# Deliberately LIGHT, not COMPREHENSIVE: the latter memsets on every alloc and
# free, which is the wrong trade on a device carrying real-time audio. It lives
# in sdkconfig.defaults.heap_debug for CI and bug hunts instead.
#
# Worth being honest about what this is: a DETECTOR, not a mitigation. The stack
# canary turns a smashed return address into an abort before it is used; heap
# poisoning only notices at the next free(), by which time the corruption has
# been live for a while. It also converts corruption into a reboot on a device
# that may be carrying calls -- which is still better than serving from a
# corrupt heap, but it is a trade, not a free win.
CONFIG_HEAP_POISONING_LIGHT=y

# ── Task Watchdog Timer: make a stall a controlled reset, not silence (#185) ──
# CONFIG_ESP_TASK_WDT_INIT=y (IDF default) already auto-starts the TWDT and
# subscribes the idle tasks; main/esp_main*.cpp additionally subscribes
# sip_server_task and feeds it once per tick. But the OTHER IDF default,
# CONFIG_ESP_TASK_WDT_PANIC=n, means a timeout only prints "Task watchdog got
# triggered..." and the wedged task is left exactly as wedged as before --
# which is silence with extra logging, not the "controlled reset with a logged
# cause" #185 asks for. This is the one line that makes the subscription in
# main/esp_main*.cpp actually reset the board instead of only ever warning.
#
# Consequence worth knowing: this also arms the auto-subscribed idle tasks
# (CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0/1, both default y) to reset instead
# of warn if either core's idle task is ever starved for the full timeout
# window (CONFIG_ESP_TASK_WDT_TIMEOUT_S, default 5s) -- nothing in this repo's
# issue history suggests that happens today, but it is a real behavior change
# on top of the #185 subscriptions, not a no-op.
CONFIG_ESP_TASK_WDT_PANIC=y
